wsig/examples/xml/MathFunctionsMapper-AbsString.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:MathFunctionsMapper">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:AbsString>
         <real>5</real>
	     <immaginary>6</immaginary>
      </urn:AbsString>
   </soapenv:Body>
</soapenv:Envelope>